# noneck's brewfile

# tap the kegs first!
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/services"
tap "homebrew/dupes"
tap "mas-cli/tap"

# roll out the casks!
cask_args appdir: '/Applications'
cask "alfred"
cask "appcleaner"
cask "atom"
cask "cakebrew"
cask "docker"
cask "docker-machine"
cask "firefox"
cask "flycut"
cask "github"
cask "google-chrome"
cask "iterm2"
cask "keka"
cask "macvim"
cask "textmate"
cask "sip"
cask "sourcetree"
cask "spotify"
cask "spotify-notifications"
cask "vagrant"
cask "virtualbox"
cask "visual-studio-code"
# FONTS
cask "font-clear-sans"
cask "font-consolas-for-powerline"
cask "font-dejavu-sans-mono-for-powerline"
cask "font-fira-code"
cask "font-fira-mono-for-powerline"
cask "font-inconsolata"
cask "font-inconsolata-for-powerline"
cask "font-liberation-mono-for-powerline"
cask "font-menlo-for-powerline"
cask "font-roboto"
# Quicklook plugins
cask "qlcolorcode"
cask "qlmarkdown"
cask "qlprettypatch"
cask "qlstephen"
cask "qlimagesize"
cask "quicklook-csv"
cask "quicklook-json"
cask "epubquicklook"

# chug those brews!
brew "ansible"
brew "atomicparsley"
brew "autoconf"
brew "awscli"
brew "bash-completion"
brew "bash-git-prompt"
brew "cask"
brew "cookiecutter"
brew "coreutils"
brew "curl"
brew "dep"
brew "flake8"
brew "freetype"
brew "gist"
brew "git"
brew "gnu-sed"
brew "gnu-tar"
brew "gnu-indent"
brew "gnu-which"
brew "gnu-grep"
brew "go-delve/delve/delve # go debugger"
brew "hadolint"
brew "hicolor-icon-theme"
brew "nmon"
brew "jq"
brew "kubernetes-cli"
brew "kubernetes-helm"
brew "midnight-commander"
brew "openssl"
brew "p7zip"
brew "pandoc"
brew "pipenv"
brew "python3"
brew "pyenv"
brew "pyenv-virtualenv"
brew "shellcheck"
brew "shfmt"
brew "ssh-copy-id"
brew "terraform"
brew "terminal-notifier"
# an honestly great command that fixes command line typos
brew "thefuck"
brew "tree"
# you'll need to unblock/allow Virtualbox(Oracle Software) in System Preferences
# after this install and before you can use docker
brew "virtualbox"
brew "watch"
brew "wget"
brew "xz"
brew "zsh"
brew "zsh-autosuggestions"
brew "zsh-completions"
brew "zsh-syntax-highlighting"
